#+TITLE: Day4
#+PROPERTY: header-args:clojure :session day4 :tangle ../src/day4.clj :results silent :comments org

#+begin_src clojure
(ns day4
  (:require [clojure.string :as str]
            [clojure.java.io :as io]
            [clojure.edn :as edn]))
#+end_src

** First, we define a function for parsing a single "word" into a kv pair.
#+begin_src clojure
(defmulti parse-value (fn [k v] k))
(defmethod parse-value :default [_ v]
  v)

(defmethod parse-value :birth-year [_ v]
  (edn/read-string v))
(defmethod parse-value :issue-year [_ v]
  (edn/read-string v))
(defmethod parse-value :expiration-year [_ v]
  (edn/read-string v))

(defmethod parse-value :height [_ v]
  (let [[match? n t] (re-matches #"(\d+)(\w+)" v)]
    {:value (when match? (edn/read-string n))
     :units (when match? t)}))

(defmethod parse-value :eye-color [_ v]
  (keyword v))

(def str->field
  {"byr" :birth-year
   "iyr" :issue-year
   "eyr" :expiration-year
   "hgt" :height
   "hcl" :hair-color
   "ecl" :eye-color
   "pid" :passport-id
   "cid" :country-id})

(defn parse-word [s]
  (let [[k v] (str/split s #":")]
    {(str->field k)
     (when v
       (parse-value (str->field k) v))}))
#+end_src


It works:
#+begin_src clojure :results replace verbatim :tangle no
(parse-word "ecl:gry")
(parse-word "byr:1980")
(parse-word "hgt:156cm")
(parse-word "hgt:")
(parse-word "hgt:156")
(parse-word "ecl:brn")
(parse-word "hcl:#124567")
#+end_src

#+RESULTS:
| {:eye-color :gry}                   |
| {:birth-year 1980}                  |
| {:height {:value 156, :units "cm"}} |
| {:height }                          |
| {:height {:value 15, :units "6"}}   |
| {:eye-color :brn}                   |
| {:hair-color "#124567"}             |


** Next we define a parsing function that can handle an entire document - which may be multiple lines:
#+begin_src clojure
(defn parse-doc [s]
  (apply merge (map parse-word (str/split s #"[\n ]+"))))
#+end_src

Make sure it works.
#+begin_src clojure :results replace verbatim :tangle no
(parse-doc "ecl:gry pid:860033327 eyr:2020 hcl:#fffffd
            byr:1937 iyr:2017 cid:147 hgt:183cm")
#+end_src

#+RESULTS:
: {:eye-color "gry", :passport-id "860033327", :expiration-year "2020", :hair-color "#fffffd", :birth-year "1937", :issue-year "2017", :country-id "147", :height "183cm"}
** Finally we define a function that parses an entire input string
#+begin_src clojure
(defn parse-str [s]
  (map parse-doc (str/split s #"\n\n")))
#+end_src

Make sure it works.
#+begin_src clojure :results replace verbatim :tangle no
(parse-str "ecl:gry pid:860033327 eyr:2020 hcl:#fffffd
byr:1937 iyr:2017 cid:147 hgt:183cm

iyr:2013 ecl:amb cid:350 eyr:2023 pid:028048884
hcl:#cfa07d byr:1929

hcl:#ae17e1 iyr:2013
eyr:2024
ecl:brn pid:760753108 byr:1931
hgt:179cm

hcl:#cfa07d eyr:2025 pid:166559648
iyr:2011 ecl:brn hgt:59in")

#+end_src

#+RESULTS:
: ({:eye-color "gry", :passport-id "860033327", :expiration-year "2020", :hair-color "#fffffd", :birth-year "1937", :issue-year "2017", :country-id "147", :height "183cm"} {:issue-year "2013", :eye-color "amb", :country-id "350", :expiration-year "2023", :passport-id "028048884", :hair-color "#cfa07d", :birth-year "1929"} {:hair-color "#ae17e1", :issue-year "2013", :expiration-year "2024", :eye-color "brn", :passport-id "760753108", :birth-year "1931", :height "179cm"} {:hair-color "#cfa07d", :expiration-year "2025", :passport-id "166559648", :issue-year "2011", :eye-color "brn", :height "59in"})

